IDEA Open Model
ArcSegment3D Properties
Compatible with IDEA StatiCa v 10.1
The ArcSegment3D type exposes the following members.
Properties
Name | Description
EndPoint
 Gets or sets the reference to Point3D endpoint of the segment.
 (Inherited from Segment3D.)
Id
 Element Id
 (Inherited from OpenElementId.)
LocalCoordinateSystem
 Local coordinate system
 (Inherited from Segment3D.)
Point
 Gets or sets the reference to Point3D of circular arc somewhere between start and end point.
StartPoint
 Gets or sets the reference to Point3D startpoint of the segment.
 (Inherited from Segment3D.)
Top
See Also
Reference
ArcSegment3D Class
IdeaRS.OpenModel.Geometry3D Namespace